DataProcessors/ПолучениеПлатежейAbills.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>ПолучениеПлатежейAbills</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>флОбменДанными</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>тчПлатежки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ППК</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ППК</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Эквайрер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорЭквайринга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыЭквайринга</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПлатежки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Метод</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.AbillsСписокТиповОплат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>тчСписания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ППК</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ППК</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Эквайрер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорЭквайринга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыЭквайринга</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПлатежки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Метод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСписания</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Enums/ВидыДоговоровКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыДоговоровКонтрагентов</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СПоставщиком</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПокупателем</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентом</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионером</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бартерный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЮрФизЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ЮрФизЛицо</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮрЛицо</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизЛицо</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВедениеВзаиморасчетовПоДоговорам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВедениеВзаиморасчетовПоДоговорам</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоДоговоруВЦелом</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьПоРасчетнымДокументам</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЗаказам</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСчетам</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыУсловийДоговоровВзаиморасчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыУсловийДоговоровВзаиморасчетов</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БезДополнительныхУсловий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СДополнительнымиУсловиями</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/vr_СпособОтправки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>vr_СпособОтправки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Почта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Email</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Medoc</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/СводнаяОплата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>СводнаяОплата</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>тчДанные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ППК</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ППК</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОплаты</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ОплатаОтПокупателяПлатежнойКартой</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Эквайрер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорЭквайринга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыЭквайринга</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПлатежки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипОплаты</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.AbillsСписокТиповОплат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/СводноеНачисление.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>СводноеНачисление</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>флОбменДанными</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>тчДанные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ППК</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ППК</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОплаты</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПлатежки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Метод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСписания</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/ПолучениеПлатежейAbills/Ext/ObjectModule.bsl
Функция НайтиКонтрагентаПоUID(ID) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Контрагенты.Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	НЕ Контрагенты.ПометкаУдаления
		|	И Контрагенты.ID = &ID";
	
	Запрос.УстановитьПараметр("ID", ID);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат СоздатьКонтрагента(СтрЗаменить(ID, Символы.НПП, ""));
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;
	
КонецФункции

Функция НайтиППК(ID, стрПодключения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ППК.Ссылка
		|ИЗ
		|	Справочник.ППК КАК ППК
		|ГДЕ
		|	НЕ ППК.ПометкаУдаления
		|	И ППК.Наименование = &ППК";
	
	Запрос.УстановитьПараметр("ППК", ID);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Контрагент 	= НайтиКонтрагентаПоUID(ID);

		Возврат СоздатьППК(Контрагент,ID,,,стрПодключения);
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
КонецФункции

Функция ПолучитьДоговор(Контрагент) Экспорт 
	
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ДоговорыКонтрагентов.Ссылка
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	НЕ ДоговорыКонтрагентов.ПометкаУдаления
		|	И ДоговорыКонтрагентов.Владелец = &Владелец
		|	И ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)";
	
	//Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Владелец", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат СоздатьДоговор(Контрагент);
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;
	
КонецФункции

Функция НайтиДоговорЭквайринга(Контрагент) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ДоговорыЭквайринга.Ссылка
		|ИЗ
		|	Справочник.ДоговорыЭквайринга КАК ДоговорыЭквайринга
		|ГДЕ
		|	НЕ ДоговорыЭквайринга.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Эквайрер", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
КонецФункции

Функция СоздатьКонтрагента(ID)
	
	стрПодключения = ПолучитьСтруктуруПодключения();
	
	Соединение = Новый HTTPСоединение(стрПодключения.Сервер, стрПодключения.Порт,,,,,Новый ЗащищенноеСоединениеOpenSSL());
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("KEY", стрПодключения.Ключ);	
	
	Запрос = Новый HTTPЗапрос("/api.cgi/users/" + ID + "/pi", Заголовки);
	
	Ответ = Соединение.Получить(Запрос);
	
	Если Ответ.КодСостояния = 200 Тогда
		ЧтениеJSON = Новый ЧтениеJSON;
		стрJSON = Ответ.ПолучитьТелоКакСтроку();
		стрJSON = СтрЗаменить(стрJSON,"\", "");
		ЧтениеJSON.УстановитьСтроку(стрJSON);
		Попытка
			СтруктураJSON = ПрочитатьJSON(ЧтениеJSON);
		Исключение
			ЗаписатьОшибкуЖР("Не удалось прочитать JSON, создание контрагента", 1);
			Сообщить(ОписаниеОшибки());
			СтруктураJSON = Неопределено;
			//Возврат Неопределено;
		КонецПопытки;
		ЧтениеJSON.Закрыть();
		Если ТипЗнч(СтруктураJSON) = Тип("Массив") И СтруктураJSON.Количество() = 0 Тогда
			ЗаписатьОшибкуЖР("Не удалось найти контрагента в ABILLS", 2, "ID = " + ID);
			Возврат Неопределено;
		КонецЕсли;
	Иначе
		Сообщить("Код ответа: "+Ответ.КодСостояния); //анализируем код состояния и делаем выводы
		Возврат Неопределено;
	КонецЕсли;
	
	КонтрОб 					= Справочники.Контрагенты.СоздатьЭлемент();
	КонтрОб.Родитель 			= Справочники.Контрагенты.НайтиПоНаименованию("Абоненти");
	КонтрОб.Наименование 		= ?(СтруктураJSON = Неопределено,"Проблемный контрагент "+ ID +" ",СтруктураJSON.fio);
	КонтрОб.НаименованиеПолное 	= ?(СтруктураJSON = Неопределено,"Проблемный контрагент "+ ID +" ",СтруктураJSON.fio); 
	КонтрОб.ID 					= ID;
	КонтрОб.Покупатель			= Истина;
	КонтрОб.ЮрФизЛицо			= Перечисления.ЮрФизЛицо.ФизЛицо;
	КонтрОб.КодПоЕДРПОУ         = ?(СтруктураJSON = Неопределено,"Проблемный контрагент "+ ID +" ",СтруктураJSON.edrpou);
	Попытка
		КонтрОб.Записать();
	Исключение
		ЗаписатьОшибкуЖР("Не удалось записать контрагента в базу 1с" , 1 , ID);
		Возврат Неопределено;	
	КонецПопытки;
	
	Договор = ПолучитьДоговор(КонтрОб.Ссылка);
	Если Договор = Неопределено Тогда
		Договор = СоздатьДоговор(КонтрОб.Ссылка);
	КонецЕсли;
	
	Если Договор = Неопределено Тогда
		ЗаписатьОшибкуЖР("Не удалось записать договор контрагента в базу 1с" , 1 , ID);
		Возврат КонтрОб.Ссылка;
	КонецЕсли;
		
	Попытка
		КонтрОб.Записать();
	Исключение
		ЗаписатьОшибкуЖР("Не удалось записать контрагента в базу 1с" , 1 , ID);
	КонецПопытки;
	
	Возврат КонтрОб.Ссылка;
	
КонецФункции

Функция СоздатьДоговор(Контрагент)
	
	ДоговорОб 						= Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
	ДоговорОб.ВидДоговора 			= Перечисления.ВидыДоговоровКонтрагентов.СПокупателем;
	ДоговорОб.Наименование 			= Контрагент.ID;
	ДоговорОб.Номер 				= Контрагент.ID;
	ДоговорОб.Владелец 				= Контрагент;
	ДоговорОб.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом;
	ДоговорОб.ВалютаВзаиморасчетов 	= глЗначениеПеременной("ВалютаРегламентированногоУчета");
	ДоговорОб.Организация 			= Справочники.Организации.ПолучитьСсылку(Новый УникальныйИдентификатор("fb9d803a-0f76-459e-a239-1900ccd279a9"));
	ДоговорОб.ВидУсловийДоговора 	= Перечисления.ВидыУсловийДоговоровВзаиморасчетов.БезДополнительныхУсловий;
	ДоговорОб.ТипЦен 				= Справочники.ТипыЦенНоменклатуры.ПустаяСсылка();
	ДоговорОб.ВыводитьИнформациюОСделкеПриПечатиДокументов = Истина;
	ДоговорОб.УстановитьСхемуНалогообложения();
	
	ДоговорОб.ВидДоговораПоГК 	= Справочники.ВидыДоговоровПоГК.Поставка;
	ДоговорОб.ФормаРасчетов 	= "Оплата з поточного рахунку";
	
	Попытка
		ДоговорОб.Записать();
		Возврат ДоговорОб.Ссылка;
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат Неопределено;	
	КонецПопытки;
	
КонецФункции

Функция СоздатьППК(Контрагент, ID, Договор = Неопределено, Адрес = "", СтрПодключения)
		
	СоединениеППК = Новый HTTPСоединение(СтрПодключения.Сервер, СтрПодключения.Порт,,,,,Новый ЗащищенноеСоединениеOpenSSL());
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("KEY", стрПодключения.Ключ);	
	
	Запрос = Новый HTTPЗапрос("/api.cgi/users/" + ID, Заголовки);
	
	Ответ = СоединениеППК.Получить(Запрос);
	
	Если Ответ.КодСостояния = 200 Тогда
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
		СтруктураJSONППК = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
		Если ТипЗнч(СтруктураJSONППК) = Тип("Массив") И СтруктураJSONППК.Количество() = 0 Тогда
			ЗаписатьОшибкуЖР("Не удалось найти контрагента в ABILLS", 2, "ID = " + ID);
			Возврат Неопределено;
		КонецЕсли;
	Иначе
		ЗаписатьОшибкуЖР("Не удалось подключиться к users/ID ; код ошибки " + Ответ.КодСостояния , 1 ,  ID = "");
		Возврат Неопределено;
	КонецЕсли;
	
	ППКОБ 					= Справочники.ППК.СоздатьЭлемент();
	ППКОБ.Код 				= ID;
	ППКОБ.Наименование 		= ID;
	ППКОБ.СпособОтправки 	= Перечисления.vr_СпособОтправки.Почта;
	ППКОБ.Контрагент 		= Контрагент;
	ППКОБ.Владелец 			= ?(Договор = Неопределено, ПолучитьДоговор(Контрагент), Договор);
	ППКОБ.UID_Билинг 		= ID;
	ППКОБ.billId 			= СтрЗаменить(Строка(СтруктураJSONППК.billId), Символы.НПП, "");
	ППКОБ.Адрес 			= Адрес;
	ППКОБ.Тариф 			= Справочники.Тарифы.НайтиПоКоду("000000001");
	ППКОБ.Активный			= Истина;
	
	Попытка
		ППКОБ.Записать();
		Возврат ППКОБ.Ссылка;
	Исключение
		ЗаписатьОшибкуЖР("Не удалось записать ППК ", 1 , ID + " ошибка " +ОписаниеОшибки());
		Сообщить(ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Функция ПолучитьСтруктуруПодключения() Экспорт 
	
	стрПодключения = Новый Структура;
	стрПодключения.Вставить("Ключ");
	стрПодключения.Вставить("Сервер");
	стрПодключения.Вставить("Порт");
	стрПодключения.Вставить("Настройка");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПодключенияКБилингуДанныеЭквайрера.Ссылка.АдресRestAPI КАК Сервер,
		|	НастройкиПодключенияКБилингуДанныеЭквайрера.Ссылка.APIKey КАК Ключ,
		|	НастройкиПодключенияКБилингуДанныеЭквайрера.Ссылка.ПортRestAPI КАК Порт,
		|	НастройкиПодключенияКБилингуДанныеЭквайрера.Ссылка КАК Настройка
		|ИЗ
		|	Справочник.НастройкиПодключенияКБилингу.ДанныеЭквайрера КАК НастройкиПодключенияКБилингуДанныеЭквайрера
		|ГДЕ
		|	НастройкиПодключенияКБилингуДанныеЭквайрера.Ссылка.Логин = &Логин";
	
	Запрос.УстановитьПараметр("Логин", "i.novash");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(стрПодключения, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
	Возврат стрПодключения;
	
КонецФункции

Процедура ПолучениеПлатежейРегламент() Экспорт
	
	тчПлатежки.Очистить();
	тчСписания.Очистить();
	
	стрПодключения = ПолучитьСтруктуруПодключения();	
	
	ПолучитьОплаты(стрПодключения); 
	//ПолучитьСписания(стрПодключения);
	
КонецПроцедуры

Процедура ПолучитьОплаты(стрПодключения) Экспорт 
	КолвоЗаписейНаСтранице = "1000";
	НомерСтраницы 		   = 0;
	сч            		   = 1;
	
	Пока Истина Цикл
		
		ТаблицаДанныхОплаты = ПолучитьМассивДанныхПоОплате(НомерСтраницы,стрПодключения,КолвоЗаписейНаСтранице);
	
		Если ТаблицаДанныхОплаты.Количество() = 0 Тогда
			Прервать;
		КонецЕсли;
	
		Для Каждого стрПлатеж из ТаблицаДанныхОплаты Цикл
			
			Если стрПлатеж.innerDescribe = "Easypay_vechir" Тогда
				
				ДатаПлатежа = Дата(Лев(СтрЗаменить(стрПлатеж.regDate, "-", ""), 8) +СтрЗаменить(Прав(стрПлатеж.regDate, 8), ":", ""));
				
				//Если КонецДня(ДатаПлатежа) >= НачалоДня(ТекущаяДата()) Тогда
				//	Продолжить;
				//КонецЕсли;
				//
				ID 			= СтрЗаменить(Строка(стрПлатеж.uid),Символы.НПП, "");					
				ППК 		= НайтиППК(ID, стрПодключения);
				
				НовСтр 						= тчПлатежки.Добавить();
				НовСтр.СуммаОплаты 			= стрПлатеж.sum;
				НовСтр.ДатаПлатежки 		= ДатаПлатежа;
				НовСтр.ППК					= ППК;
				НовСтр.Контрагент 			= ППК.Контрагент;
				НовСтр.ДоговорКонтрагента 	= ПолучитьДоговорПоОрганизации(Справочники.Организации.ПолучитьСсылку(Новый УникальныйИдентификатор("fb9d803a-0f76-459e-a239-1900ccd279a9")),ППК.Наименование,ППК.Контрагент);
				НовСтр.Метод				= НайтиСодатьМетод(стрПлатеж.Method);
				НовСтр.ДоговорЭквайринга 	= стрПодключения.Настройка.ДанныеЭквайрера.Найти("Easypay_vechir","slug").ДоговорЭквайринга;
				НовСтр.Организация			= НовСтр.ДоговорЭквайринга.ДоговорВзаиморасчетов.Организация;
				НовСтр.Эквайрер 			= НовСтр.ДоговорЭквайринга.Эквайрер;
				НовСтр.ID					= СтрЗаменить(стрПлатеж.ID,Символы.НПП,"");	
			Иначе
				
				ДатаПлатежа = Дата(Лев(СтрЗаменить(стрПлатеж.regDate, "-", ""), 8) +СтрЗаменить(Прав(стрПлатеж.regDate, 8), ":", ""));
				
				//Если КонецДня(ДатаПлатежа) >= НачалоДня(ТекущаяДата()) Тогда
				//	Продолжить;
				//КонецЕсли;
				
				ID 			= СтрЗаменить(Строка(стрПлатеж.uid),Символы.НПП, "");
				ППК 		= НайтиППК(ID, стрПодключения);
				
				НовСтр 						= тчПлатежки.Добавить();
				НовСтр.СуммаОплаты 			= стрПлатеж.sum;
				НовСтр.ДатаПлатежки 		= ДатаПлатежа;
				НовСтр.ППК					= ППК;
				НовСтр.Контрагент 			= ППК.Контрагент;
				НовСтр.ДоговорКонтрагента 	= ПолучитьДоговорПоОрганизации(Справочники.Организации.ПолучитьСсылку(Новый УникальныйИдентификатор("fb9d803a-0f76-459e-a239-1900ccd279a9")),ППК.Наименование,ППК.Контрагент);
				НовСтр.Метод				= НайтиСодатьМетод(стрПлатеж.Method);
				НовСтр.ДоговорЭквайринга 	= стрПодключения.Настройка.ДанныеЭквайрера.Найти("","slug").ДоговорЭквайринга;;
				НовСтр.Организация			= НовСтр.ДоговорЭквайринга.ДоговорВзаиморасчетов.Организация;
				НовСтр.Эквайрер 			= НовСтр.ДоговорЭквайринга.Эквайрер;
				НовСтр.ID					= СтрЗаменить(стрПлатеж.ID,Символы.НПП,"");					
			КонецЕсли;
			
			сч = сч + 1;
		КонецЦикла;
		
		НомерСтраницы = Число(НомерСтраницы) + Число(КолвоЗаписейНаСтранице);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПолучитьСписания(стрПодключения) Экспорт 
	//
	//МетодыСписания = ПолучитьМедотыСписания();
	//СоответствиеМетодов = Новый Соответствие;
	//Для Каждого стрМетод из МетодыСписания Цикл
	//	СоответствиеМетодов.Вставить(Число(стрМетод.Метод), стрМетод.Номенклатура);
	//КонецЦикла;
	//
	//НомерСтраницы = 0;
	//
	//Пока Истина Цикл
	//	
	//	Соединение = Новый HTTPСоединение(стрПодключения.Сервер, стрПодключения.Порт,,,,,Новый ЗащищенноеСоединениеOpenSSL());
	//	
	//	Заголовки = Новый Соответствие;
	//	Заголовки.Вставить("KEY", "Y2t+32_e-TMX+e2z");	
	//	
	//	ДатаНач 				= Формат(Дата(ТекущаяДата())-86400, "ДФ=yyyy-MM-dd"); //вчерашний день
	//	ДатаКон 				= Формат(Дата(ТекущаяДата())-86400, "ДФ=yyyy-MM-dd");//вчерашний день
	//	
	//	Если ЗначениеЗаполнено(ДатаС) Тогда
	//		ДатаНач = Формат(ДатаС, "ДФ=yyyy-MM-dd");
	//	КонецЕсли;
	//	
	//	Если ЗначениеЗаполнено(ДатаПО) Тогда
	//		ДатаКон = Формат(ДатаПо, "ДФ=yyyy-MM-dd");	
	//	КонецЕсли;
	//	
	//	КолвоЗаписейНаСтранице 	= "1000";
	//	НомерСтраницы 			= СтрЗаменить(Строка(НомерСтраницы), Символы.НПП, "");
	//	Метод 					= 0;
	//	
	//	Запрос = Новый HTTPЗапрос("/api.cgi/fees?fromDate="+ДатаНач + "&toDate=" + ДатаКон  
	//	+"&pageRows=" + КолвоЗаписейНаСтранице 
	//	+"&method=" + Метод
	//	+"&pg=" + НомерСтраницы, Заголовки);
	//	
	//	Ответ = Соединение.Получить(Запрос);
	//	
	//	//Организация = ?(ЗначениеЗаполнено(Организация), Организация, стрПодключения.Организация);
	//	Если Ответ.КодСостояния = 200 Тогда
	//		ЧтениеJSON = Новый ЧтениеJSON;
	//		стрJSON = Ответ.ПолучитьТелоКакСтроку();
	//		ЧтениеJSON.УстановитьСтроку(стрJSON);
	//		Попытка
	//			СтруктураJSON = ПрочитатьJSON(ЧтениеJSON);
	//		Исключение
	//			ЗаписатьОшибкуЖР("Не прочитать json", 1, стрJSON);
	//			Сообщить("Код ответа: "+Ответ.КодСостояния); //анализируем код состояния и делаем выводы
	//			ЧтениеJSON.Закрыть();
	//			Прервать;
	//		КонецПопытки;
	//		ЧтениеJSON.Закрыть();
	//	Иначе
	//		ЗаписатьОшибкуЖР("Не удалось подключиться к методу fees", 1);
	//		Сообщить("Код ответа: "+Ответ.КодСостояния); //анализируем код состояния и делаем выводы
	//		Возврат ;
	//	КонецЕсли;
	//	
	//	Если СтруктураJSON.Количество() = 0 Тогда
	//		Прервать;
	//	КонецЕсли;
	//	
	//	сч = 0;
	//	Для Каждого стрСписания из СтруктураJSON Цикл
	//		
	//		сч 			= сч + 1;
	//		ДатаПлатежа = Дата(Лев(СтрЗаменить(стрСписания.regDate, "-", ""), 8) +СтрЗаменить(Прав(стрСписания.regDate, 8), ":", ""));
	//		ID 			= СтрЗаменить(Строка(стрСписания.uid),Символы.НПП, "");			
	//		ППК 		= НайтиППК(ID, стрПодключения);
	//				
	//		НовСтр 						= тчСписания.Добавить();
	//		НовСтр.СуммаОплаты 			= стрСписания.sum;
	//		НовСтр.ДатаПлатежки 		= ДатаПлатежа;
	//		НовСтр.ППК					= ППК;
	//		НовСтр.Контрагент 			= ППК.Контрагент;
	//		НовСтр.ДоговорКонтрагента 	= ППК.Владелец;
	//		НовСтр.Метод				= стрСписания.method;
	//		НовСтр.ВидСписания			= СоответствиеМетодов[стрСписания.method];
	//		НовСтр.ID				    = СтрЗаменить(стрСписания.id, Символы.НПП, "");
	//		
	//		НовСтр.Организация			= Справочники.Организации.ПолучитьСсылку(Новый УникальныйИдентификатор("bc270abf-9b1b-11ed-bf12-00155d86af1e"));//Vechir упр;
	//		
	//	КонецЦикла;
	//	
	//	НомерСтраницы = Число(НомерСтраницы) + Число(КолвоЗаписейНаСтранице);
	//	
	//КонецЦикла;
	//		
КонецПроцедуры

Функция ПолучитьМедотыСписания() 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПодключенияКБилингуСоответвиеМетодовИНоменклатуры.Метод,
		|	НастройкиПодключенияКБилингуСоответвиеМетодовИНоменклатуры.Номенклатура
		|ИЗ
		|	Справочник.НастройкиПодключенияКБилингу.СоответвиеМетодовИНоменклатуры КАК НастройкиПодключенияКБилингуСоответвиеМетодовИНоменклатуры
		|ГДЕ
		|	НастройкиПодключенияКБилингуСоответвиеМетодовИНоменклатуры.Ссылка.Логин = &Логин";
	
	Запрос.УстановитьПараметр("Логин", "i.novash");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

Процедура СоздатьСводнуюОплату(Организация) Экспорт 
	
	Если тчПлатежки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СводнаяОплата.Ссылка
	               |ИЗ
	               |	Документ.СводнаяОплата КАК СводнаяОплата
	               |ГДЕ
	               |	СводнаяОплата.Дата МЕЖДУ &Дата1 И &Дата2";
	Запрос.УстановитьПараметр("Дата1",НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Дата2",КонецДня(ТекущаяДата()));
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество()=0 Тогда 
		
		ДокОб 				= Документы.СводнаяОплата.СоздатьДокумент();
		////ДокОб.Организация 	= Организация;
		ДокОб.Дата 			= ТекущаяДата();
	Иначе
		ДокОб = РезультатЗапроса[0].Ссылка.ПолучитьОбъект();
		
	КонецЕсли;

	Для Каждого стрПлатеж из тчПлатежки Цикл
		Если ДокОб.тчДанные.НайтиСтроки(Новый структура("ID",стрПлатеж.ID)).Количество()=0 тогда
			СтрокаПлатежи = ДокОб.тчДанные.Добавить();
			
			ЗаполнитьЗначенияСвойств(СтрокаПлатежи, стрПлатеж);
			СтрокаПлатежи.ТипОплаты = стрПлатеж.Метод; 
		КонецЕсли;
	КонецЦикла;
	
	ДокОб.Записать();
	
	ДокОб.СоздатьОплату(флОбменДанными);
	
КонецПроцедуры

Процедура СоздатьСводноеНачисление(Организация) Экспорт 
	
	ДокОб 				= Документы.СводноеНачисление.СоздатьДокумент();
	ДокОб.Организация 	= Организация;
	ДокОб.Дата 			= ТекущаяДата();
	
	Для Каждого стрПлатеж из тчСписания Цикл
		ЗаполнитьЗначенияСвойств(ДокОб.тчДанные.Добавить(), стрПлатеж);		
	КонецЦикла;
	
	ДокОб.Записать();
	
	ДокОб.СоздатьНачисления(Организация, флОбменДанными);
	
КонецПроцедуры

Процедура ЗаписатьОшибкуЖР(Ошибка, Статус, ДопИнфа = Неопределено) Экспорт
	
	Если ДопИнфа <> Неопределено Тогда
		Ошибка = Ошибка + "----" + ДопИнфа
	КонецЕсли;
	
	Если Статус = 1 Тогда
		УровеньЖР = УровеньЖурналаРегистрации.Ошибка; 
	Иначе
		УровеньЖР = УровеньЖурналаРегистрации.Предупреждение;
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("Получение платежей ABILLS", УровеньЖР,,, Ошибка);
	
КонецПроцедуры

Функция ПолучитьМассивДанныхПоОплате(НомерСтраницы,стрПодключения,КолвоЗаписейНаСтранице)
	
		Соединение = Новый HTTPСоединение(стрПодключения.Сервер, стрПодключения.Порт,,,,,Новый ЗащищенноеСоединениеOpenSSL());
		
		Заголовки = Новый Соответствие;
		Заголовки.Вставить("KEY", стрПодключения.Ключ);	
			
		ДатаНач 				= Формат(Дата(ТекущаяДата()), "ДФ=yyyy-MM-dd"); //вчерашний день
		ДатаКон 				= Формат(Дата(ТекущаяДата()), "ДФ=yyyy-MM-dd");//вчерашний день
		
		Если ЗначениеЗаполнено(ДатаС) Тогда
			ДатаНач = Формат(ДатаС, "ДФ=yyyy-MM-dd");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДатаПО) Тогда
			ДатаКон = Формат(ДатаПо, "ДФ=yyyy-MM-dd");	
		КонецЕсли;
		
		НомерСтраницы 			= СтрЗаменить(Строка(НомерСтраницы), Символы.НПП, "");
		
		
		Запрос = Новый HTTPЗапрос("/api.cgi/payments?fromDate="+ДатаНач + "&toDate=" + ДатаКон  
		+"&pageRows=" + КолвоЗаписейНаСтранице 
		//+"&method=" + Метод
		+"&pg=" + НомерСтраницы, Заголовки);
		
		Ответ = Соединение.Получить(Запрос);
		Если Ответ.КодСостояния = 200 Тогда
			ЧтениеJSON 	= Новый ЧтениеJSON;
			стрJSON 	= Ответ.ПолучитьТелоКакСтроку();
			ЧтениеJSON.УстановитьСтроку(стрJSON);
			Попытка
				СтруктураJSON = ПрочитатьJSON(ЧтениеJSON);
			Исключение
				ЗаписатьОшибкуЖР("Не прочитать json", 1, стрJSON);
				Сообщить("Код ответа: "+Ответ.КодСостояния); //анализируем код состояния и делаем выводы
				ЧтениеJSON.Закрыть();
			КонецПопытки;
			ЧтениеJSON.Закрыть();
			Возврат СтруктураJSON; 
		Иначе
			ЗаписатьОшибкуЖР("Не удалось подключиться к методу payments", 1);
			Сообщить("Код ответа: "+Ответ.КодСостояния); //анализируем код состояния и делаем выводы
			Возврат Новый ТаблицаЗначений;
		КонецЕсли;
		
	
	
	КонецФункции
	
Функция НайтиСодатьМетод(НомерМетода)
	
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	AbillsСписокТиповОплат.Ссылка
	               |ИЗ
	               |	Справочник.AbillsСписокТиповОплат КАК AbillsСписокТиповОплат
	               |ГДЕ
	               |	AbillsСписокТиповОплат.КодAbills = &КодAbills";
	Запрос.УстановитьПараметр("КодAbills",НомерМетода);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() Тогда 
		
		Возврат РезультатЗапроса[0].Ссылка;
		
	Иначе
		
		Элемент = Справочники.AbillsСписокТиповОплат.СоздатьЭлемент();
		Элемент.Наименование = НомерМетода;
		Элемент.КодAbills    = НомерМетода;
		Элемент.Записать();
		
		Возврат Элемент.Ссылка;
		
	КонецЕсли;
	
	
	
КонецФункции

Функция ПолучитьДоговорПоОрганизации(Организация,НомерППК,Контрагент)
	
	Запрос = новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ДоговорыКонтрагентов.Ссылка
	                |ИЗ
	                |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	                |ГДЕ
	                |	ДоговорыКонтрагентов.Владелец = &Владелец
	                |	И ДоговорыКонтрагентов.Организация = &Организация
	                |	И ДоговорыКонтрагентов.Наименование = &Наименование
	                |	И ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)" ;
	Запрос.УстановитьПараметр("Владелец",Контрагент);
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("Наименование",НомерППК);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() Тогда 
		Возврат РезультатЗапроса[0].Ссылка;
	Иначе
		Договор = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
		Договор.Наименование 		  = НомерППК;
		Договор.ВидДоговора			  = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем;
		Договор.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом;
		Договор.Организация			  = Организация;
		Договор.Владелец			  = Контрагент;
		Договор.Номер				  = НомерППК;
		Договор.ВалютаВзаиморасчетов  = Константы.ВалютаРегламентированногоУчета.Получить();
		Договор.СхемаНалоговогоУчета = Справочники.СхемыНалоговогоУчетаПоДоговорамКонтрагентов.ПоПервомуСобытию;
		Договор.Записать();
		Возврат Договор.Ссылка;
		
	КонецЕсли;
	
	Возврат Неопределено;
		
КонецФункции
